export const ruLocales = {
  "NikitaFilonov": "Никита Филонов",
  "Get started": "Перейти к резюме",
  "Search": "Поиск",
  "Home": "Главная",
  "Overview": "Обзор",
  "Education": "Образование",
  "Experience": "Опыт работы",
  "Projects": "Проекты",
  "Languages": "Язык",
  "LastUpdated": "Обновлено"
}

export const MainRuLocales = {
  "Welcome": "Добро пожаловать! Вы находитесь на личном сайте Никиты Филонова.",
  "WelcomeSubtitle": "Я увлекаюсь веб и мобильной разработкой",
  "HighProductivity": "Высокая продуктивность",
  "HighProductivityDescription": "Я всегда нацелен на результат. Если проект мне\n" +
    "интересен, то я способен сделать проект за неделю,\n" +
    "в то время, когда другим разработчикам требуются месяцы\n" +
    "на реализацию.",
  "ModernStack": "Современный стэк",
  "ModernStackDescription": "Я использую только современные технологии, которые\n" +
    "обеспечивают высокую продизводительность. А также\n" +
    "позволяют легко маштабировать проект.",
  "VersatileExperience": "Разносторонний опыт",
  "VersatileExperienceDescription": "В моей практике был опыт, как бэкенд разработки, так и\n" +
    "фронтенд (веб/мобилка). Есть огромный опыт написания\n" +
    "автотестов, поэтому мой код всегда покрывается\n" +
    "API и Unit тестами. Для меня не проблема настроить\n" +
    "инфраструктуру проекта в CI/CD."
}


export const AboutRuLocales = {
  "MainInfo": "Общая информация",
  "MainInfoBlock1": "Имею значительный опыт в написании автоматизированных тестов. А также\n" +
    "в настройке CI для автотестов. Имеется большой опыт работы с\n" +
    "фронтендом. Понимаю логику построения фронтенда. Есть опыт работы\n" +
    "с https, wss с фронта. Отлично знаю, как работает локализация.\n" +
    "Спокойно могу работать с HTML/CSS",
  "MainInfoBlock2": "Имею большой опыт работы с бэкенд частью. Отлично понимаю, все принципы построения\n" +
    "RESTful приложений. Умею работать как с реляционными так и с нереляционными базами\n" +
    "данных. Хорошо разбираюсь в видах авторизаций Basic/API KEY/Bearer/OAuth2/Session\n" +
    "и имею опыт внедрения в проекты.",
  "SocialApi": "Есть опыт взаимодействия с API популярных соц сетей и месенджеров, таких как:",
  "GoogleApi": "Также есть опыт работы и интеграции в проекты таких google сервисов, как:",
  "FirebaseApi": "Для мобильных приложений есть опыт работы с Firebase, а именно:",
  "PushNotifications": "Push-уведмоления",
  "BackendPushNotifications": "Отправка Push-уведомлений c бэкенда",
  "MainInfoBlock3": "На мобильных устройствах есть опыт реализации чата, с отправкой\n" +
    "изображений и файлов. Есть опыт реализации с deep linking для мобильных\n" +
    "приложений. Для мобильных приложений спокойно могу работать с локальными\n" +
    "базами данных, или же с поддержкой сервера. При необходимости могу\n" +
    "граммотно миксовать два тип сервер + локальная бд. Имею опыт реализации\n" +
    "dark/light theme для мобильных приложений.",
  "MainInfoBlock4": "Имеется опыт работы с монолитной и микросервисной архитектурой. Также имеется\n" +
    "опыт создания переодически выполняемых задач на стороне бэкенда.",
  "TechnologyStack": "Стэк технологий",
  "AutomationTesting": "Автоматизация тестирования:",
  "CI/CD Instruments": "Инструменты CI/CD:",
  "SQL databases": "Базы данных SQL:",
  "NOSQL databases": "Базы данных NOSQL:",
  "Instruments": "Инструменты:",
  "MainRQTimerDescription": "приложение для мониторинга боссов в MMORPG. Самый успешный и\n" +
    "высоко нагруженный проект. Имеет серверную и 3 раных клиентских части: Desktop,\n" +
    "Mobile, Web.",
  "MainTaskManagerDescription": "самый первый мой проект. Приложение для\n" +
    "заметок/задач. Имеет 2 клиентские части: Web, Mobile",
  "MainShipshapeDescription": "социальная сеть для обмена советами\n" +
    "по красоте и уходу за собой. Имеется только мобильная клиентская часть. В приложении есть посты,\n" +
    "статьи, профиль пользователя, deep linking, чат.",
  "MainDailyFoodDescription": "приложение для списка покупок и рецептов.\n" +
    "Имеется только мобильная клиентская часть. В приложении есть сторис, широкий выбор продуктов,\n" +
    "возможность создавать рецепты с фотографиями, категории, достижения.",
  "MainTodoDescription": "приложения для списка дел. От Task Manager\n" +
    "отличается тем, что работает без поддержки сервера. И имеет более обширный функционал.",
  "MainLanguages": "Языки",
  "All applications can be viewed/downloaded in": "Все приложения можно посмотреть/скачать в",
  "my profile": "моем профиле",
  "Russian — native": "Русский — родной",
  "English - speak and understand fluently": "English — свободно говорю и понимаю",
  "Contacts": "Контакты"
}


export const EducationRuLocales = {
  "EducationBlock1": "На данный момент у меня только среднее общее образование. Но это не мешает мне жить\n" +
    "и разиваваться :)",
  "EducationBlock2": 'Пробовал ли я получать высшее/среднее специально образование? Да. Какое-то время\n' +
    'учился в Смоленский филиал НИУ "МЭИ" и посещал дополнительную профессиональную\n' +
    'переподготовку по направлению "Управление персоналом". Совмещал работу QA Automation\n' +
    'Engineer с учебой, но на 3-м курсе я бросил обучение.'
}


export const WorkRuLocales = {
  "WorkExperience": "2 года 6 месяцев",
  "Workplace responsibilities": "Обязанности на рабочем месте",
  "AlemiraTitle": "Декабрь 2020 - настоящее время",
  "Moscow": "Москва",
  "AlemiraProject": "Проект: Образовательный комплекс для создания виртуальных лабораторных работ.\n" +
    "Образовательная платформа для курсов.",
  "AlemiraAchievements": "Достижения: С нуля поднял тестирование на двух проектах. Сделал множество\n" +
    "интеграций для автотестов. С нуля за два месяца полностью автоматизировал все\n" +
    "регрессионной тестирование. Выстроил инфраструктуру в GitLab CI с использованием\n" +
    "Docker Registry.",
  "AlemiraResp1": "Покрытие автотестами нескольких проектов компании",
  "AlemiraResp2": "Разработка и развитие тестового фрэймворка",
  "AlemiraResp3": "Написание API/UI e2e, интеграционных тестов",
  "AlemiraResp4": "Настрока GitLab CI для автотестов",
  "AlemiraResp5": "Написание Dockerfile-ов и запуск автотестов в Docker",
  "AlemiraResp6": "Интеграция автотестов с проектом на .NET",
  "AlemiraResp7": "Интеграция автотестов с MS SQL",
  "AlemiraResp8": "Интеграция с Allure TestOps",
  "AlemiraResp9": "Интеграция автотестов со Slack",
  "AlemiraResp10": "Работа с Selenium, Pytest, Pytest-BDD, Python 3.8",
  "AlemiraResp11": "Генерация видео и скриншотов для UI тестов, с последующим отображеним а Allure отчете",
  "AlemiraResp12": "Работа с GitLab, YouTack, Miro, Figma, Slack",
  "WakeAppTitle": "Сентябрь 2020 — Декабрь 2020",
  "WakeAppProject": "Проект: Маркетинговая CRM система для обработки KPI, кликов, конверсий, продаж.",
  "WakeAppAchievements": "Достижения: С нуля написал автотесты для API. Поднял инфраструктуру автотестов\n" +
    "в Jenkins + проинтегрировал Jenkins со Slack. Сделал интеграцию с MySQL, что\n" +
    "позволило тестам работать на любом окружении - тесты сами создавали себе\n" +
    "необходимые данные. Большим достижением является то, что написанные мною автотесты\n" +
    "до сих пор (08.07.2021) работают в Jenkins CI и успешно функционаруют, при этом\n" +
    "никаких правок в автотесты и сам фрэймворк не вносилось.",
  "WakeAppResp1": "Разработка тестового фрэймворка",
  "WakeAppResp2": "Настройка CI в Jenkins",
  "WakeAppResp3": "Написание API e2e тестов",
  "WakeAppResp4": "Работа с Selenium, Pytest, Behave, Python 3.7",
  "WakeAppResp5": "Использование Allure отчетов",
  "WakeAppResp6": "Интеграция автотестов с MySQL",
  "WakeAppResp7": "Интеграция автотестов с TestRail",
  "WakeAppResp8": "Написание технической документации к автотестам",
  "WakeAppResp9": "Генерация видео и скриншотов для UI тестов, с последующим отображеним а Allure отчете",
  "WakeAppResp10": "Работа с GitHub, Jira, Confluence, Slack, TestRail",
  "InfotecsTitle": "Январь 2020 — Август 2020",
  "InfotecsProject": "Проект: Автоматизированный комплекс для поисковой, журналистской, расследовательской деятельности.",
  "InfotecsAchievements": "Достижения: С нуля поднял API/UI тестирование. Внес значительные\n" +
    "изменения в флоу работы команды: описание задач, составление баг\n" +
    "репортов, тестирование исправленных багов. Когда я пришел в\n" +
    "компанию, продукт находился на стадии разработки и даже не была\n" +
    "выпущена версия. К выходу первой версии, продукт был полностью\n" +
    "покрыт автотестами, было найдено и проконтролированно множество багов.",
  "InfotecsResp1": "Разработка тестового фрэймворка",
  "InfotecsResp2": "Работа c Django/Django Rest Framework",
  "InfotecsResp3": "Интеграция автотестов с Django",
  "InfotecsResp4": "Интеграция автотестов с PostgreSQL",
  "InfotecsResp5": "Написание документации к автотестам",
  "InfotecsResp6": "Ручная проверка дефектов",
  "InfotecsResp7": "Написание API/UI e2e тестов",
  "InfotecsResp8": "Работа с Selenium, Pytest, Python 3.7",
  "InfotecsResp9": "Работа с GitLab, YouTrack",
  "OmnicommTitle1": "Сентябрь 2019 — Декабрь 2019",
  "OmnicommProject1": "Проект: Образовательная платформа для создания лабораторных работ, тестовых заданий",
  "OmnicommAchievements1": "Достижения: По собсвенному желанию начал автоматизацию на проекте.\n" +
    "С нуля были автоматизированны все регрессионные тесты.",
  "OmnicommResp1_1": "Написание API/UI e2e тестов",
  "OmnicommResp1_2": "Работа с Selenium, Pytest, Python 3.7",
  "OmnicommResp1_3": "Нагрузочное тестирование с помощью Locust",
  "OmnicommResp1_4": "Написание документации к автотестам",
  "OmnicommResp1_5": "Подготовка тестового окружения - TeamCity",
  "OmnicommResp1_6": "Контроль за исправлением багов",
  "OmnicommResp1_7": "Работа с GitHub, Jira, Confluence, TeamCity",
  "OmnicommTitle2": "Февраль 2019 — Август 2019",
  "OmnicommProject2": "Проект: Комплекс по контролю топлива в грузовом транспорте",
  "OmnicommAchievements2": "Достижения: Первый из команды предложил внедрение автоматизированного тестирования,\n" +
    "в последующем был перевед на другой проект для развития автоматизации.",
  "OmnicommResp2_1": "Тестирование API/UI",
  "OmnicommResp2_2": "Регресс, смоук тестирование",
  "OmnicommResp2_3": "Подготовка тестового окружения - TeamCity",
  "OmnicommResp2_4": "Работа с Jira, Confluence, TeamCity, TestRail",
  "OmnicommResp2_5": "Писал тест-кейсы, чек-листы, тест-планы + поддерживал все в актуальном состоянии",
}


export const ProjectsRuLocales = {
  "Links": "Ссылки",
  "Description": "Описание",
  "Functional": "Функционал",
  "RQTimerBlock1": "Проект предназначен для мониторинга боссов/элитных монстров в реальном\n" +
    "времени, само приложение было написанно для MMORPG игры Royal Quest. Но\n" +
    "на самом деле, может быть использованно для любой многопользовательской игры.\n" +
    "Это один из самых маштабных проектов, которы мне приходилось реализовывать\n" +
    "и поддерживать. На данный момент приложением пользуются почти 500 пользователей.\n" +
    "Ежедневно сервис посещают около 100 юзеров.",
  "RQTimerBlock2": "Серверная и Web часть были написаны за одну неделю. Далее вышло мобильное приложение,\n" +
    "после вышло Desktop приложение. На данный момент было выпущено 7 релизов.",
  "RQTimerBlock3": "Desktop приложение имеет overlay для игры, системные уведомления.",
  "RQTimerFunc1": "Создание/удаление/обновление личных и групповых таймеров",
  "RQTimerFunc2": "Пользователи могут создавать группы для коллективного использования",
  "RQTimerFunc3": "В группах есть система прав доступа",
  "RQTimerFunc4": "В группах для таймеров сохраняется история изменений",
  "RQTimerFunc5": "Есть возможность восстановления из истории",
  "RQTimerFunc6": "Уведомления в Telegram",
  "RQTimerFunc7": "Уведомления через Вконтакте",
  "RQTimerFunc8": "Уведомления в Discord",
  "RQTimerFunc9": "Уведомления в мобильном приложении",
  "RQTimerFunc10": "Звуковые уведомления в таймере",
  "RQTimerFunc11": "Системные уведомления в Desktop клиенте",
  "RQTimerFunc12": "Настройки уведомлений, комментариев, звука",
  "RQTimerFunc13": "Google Авторизация",
  "RQTimerFunc14": "Приглашение участников через почту",
  "TaskManagerBlock1": "Это первый мой проект и первое мобильное приложение. Приложение предназначено для создания заметок/задач.\n" +
    "В приложении есть возможность шаринга задач между пользователями. На текущий момент им пользуется\n" +
    "почти 200 человек.",
  "TaskManagerFunc1": "Создание/удаление/обновление задач",
  "TaskManagerFunc2": "Уведомления в Telegram",
  "TaskManagerFunc3": "Увдомления в мобильном приложении",
  "TaskManagerFunc4": "Уведомления в Web версии",
  "TaskManagerFunc5": "Уведомления на почту",
  "TaskManagerFunc6": "Шаринг задач между пользователями",
  "TaskManagerFunc7": "Комментарии к пошаренным задачам",
  "TaskManagerFunc8": "Множество настроек, в том числе кастомные лэйблы к задачам",
  "ShipshapeBlock1": "Социальная сеть для обмена советами по уходу за собой. Приложение имеет\n" +
    "довольно обширный функционал и встроенную базу со статьями по уходу.\n" +
    "Есть разделение статей по категориям: \"Лицо\", \"Волосы\", \"Тело\", \"Здоровье\".\n" +
    "Также приложение индивидуально подбирает советы под выбранный тип волос,\n" +
    "кожи, возраст. Пользователи могу создавать посты и общаться в чате,\n" +
    "подписываться на других пользователей.",
  "ShipshapeFunc1": "Создание постов",
  "ShipshapeFunc2": "Просмотр встроенных статей и фильтрация по ним",
  "ShipshapeFunc3": "Общение в чате, внутри приложения",
  "ShipshapeFunc4": "Подписки, подписчики",
  "ShipshapeFunc5": "Профиль пользователя",
  "ShipshapeFunc6": "Push-уведомления о новый статьях, подписках, о сообщениях в чате",
  "ShipshapeFunc7": "Настройки уведомлений",
  "ShipshapeFunc8": "Deep linking - возможность поделиться профилем, статьей, постом",
  "ShipshapeFunc9": "Лайки, комментарии к постам",
  "ShipshapeFunc10": "Индивидуальная настройка физиологических данных, на основе которых подбираются\n" +
    "статьи.",
  "ShipshapeFunc11": "Индивидулаьный профиль пользователя с настройкой данных о себе и фото профиля",
  "ShipshapeFunc12": "Просмотр уведомлений",
  "ShipshapeFunc13": "Просмотр лайкнутых статей",
  "ShipshapeFunc14": "Система тикетов и обращения в тех поддержку",
  "DailyFoodBlock1": "Приложение для списка покупок и рецептов. В приложении можно создавать рецепты и на\n" +
    "основе них собирать корзину покупок. Daily Food это новая версия\n" +
    "приложения",
  "DailyFoodBlock2": "В новой версии был полностью переработан дизайн и функционал, увеличелось количество\n" +
    "продуктов с 300, до 3000. Была проведена большая работа над производительностью приложения. Добавлена\n" +
    "анимация.",
  "DailyFoodFunc1": "Создание/удаление/изменение/копирование списков с продуктами",
  "DailyFoodFunc2": "Добавление своих продуктов",
  "DailyFoodFunc3": "Добавление своих категорий продуктов, с фото",
  "DailyFoodFunc4": "Добавление фото к продуктам",
  "DailyFoodFunc5": "Сторис в приложении",
  "DailyFoodFunc6": "Массовое выделение для всех списков",
  "DailyFoodFunc7": "Понравившиеся продукты/рецепты/списки",
  "DailyFoodFunc8": "Анимация для сортировки и всех списков",
  "DailyFoodFunc9": "Есть возможность поделиться списком с другим юзером",
  "DailyFoodFunc10": "Создание рецептов с фото, описанием, временем приготовления",
  "DailyFoodFunc11": "Сиситема достижений для мотивации пользователей посещать приложение",
  "TodoBlock1": "Приложения для напоминаний и заметок. Имеет очень удобный интерфейс,\n" +
    "для создания пометок. Имеет систему для напоминаний с повторами в виде\n" +
    "Push-уведомлений. От Task Manager отличается тем, что полностью\n" +
    "использует локальную базу данных. В приложении также есть планировщик\n" +
    "дня.",
  "TodoFunc1": "Создание/удаление/изменение заметок",
  "TodoFunc2": "Создание/удаление/изменение списков в заметками",
  "TodoFunc3": "Изменение фона списка",
  "TodoFunc4": "Планировщик дня",
  "TodoFunc5": "Глобальный поиск по всем заметкам",
  "TodoFunc6": "Индивидуальные настройки разделов с задачами",
  "TodoFunc7": "Добавление под шагов для заметок",
  "TodoFunc8": "Для каждой заметки есть возможность настроить время напоминания и\n" +
    "переодичность повторения",
  "TodoFunc9": "Есть возможность настроить время выполнения",
  "TodoFunc10": "Приложение имеет очень удобный и компактный интерфейс"
}
