export const ruLocales = {
  "NikitaFilonov": "Никита Филонов",
  "Get started": "Перейти к резюме",
  "Search": "Поиск",
  "Home": "Главная",
  "Overview": "Обзор",
  "Education": "Образование",
  "Experience": "Опыт работы",
  "Projects": "Проекты",
  "Languages": "Язык",
  "LastUpdated": "Обновлено"
}

export const MainRuLocales = {
  "Welcome": "Добро пожаловать! Вы находитесь на личном сайте Никиты Филонова.",
  "WelcomeSubtitle": "Я увлекаюсь веб и мобильной разработкой",
  "HighProductivity": "Высокая продуктивность",
  "HighProductivityDescription": "Я всегда нацелен на результат. Если проект мне\n" +
    "интересен, то я способен сделать проект за неделю,\n" +
    "в то время, когда другим разработчикам требуются месяцы\n" +
    "на реализацию.",
  "ModernStack": "Современный стэк",
  "ModernStackDescription": "Я использую только современные технологии, которые\n" +
    "обеспечивают высокую продизводительность. А также\n" +
    "позволяют легко маштабировать проект.",
  "VersatileExperience": "Разносторонний опыт",
  "VersatileExperienceDescription": "В моей практике был опыт, как бэкенд разработки, так и\n" +
    "фронтенд (веб/мобилка). Есть огромный опыт написания\n" +
    "автотестов, поэтому мой код всегда покрывается\n" +
    "API и Unit тестами. Для меня не проблема настроить\n" +
    "инфраструктуру проекта в CI/CD."
}


export const AboutRuLocales = {
  "MainInfo": "Общая информация",
  "MainInfoBlock1": "Имею значительный опыт в написании автоматизированных тестов. А также\n" +
    "в настройке CI для автотестов. Имеется большой опыт работы с\n" +
    "фронтендом. Понимаю логику построения фронтенда. Есть опыт работы\n" +
    "с https, wss с фронта. Отлично знаю, как работает локализация.\n" +
    "Спокойно могу работать с HTML/CSS",
  "MainInfoBlock2": "Имею большой опыт работы с бэкенд частью. Отлично понимаю, все принципы построения\n" +
    "RESTful приложений. Умею работать как с реляционными так и с нереляционными базами\n" +
    "данных. Хорошо разбираюсь в видах авторизаций Basic/API KEY/Bearer/OAuth2/Session\n" +
    "и имею опыт внедрения в проекты.",
  "SocialApi": "Есть опыт взаимодействия с API популярных соц сетей и месенджеров, таких как:",
  "GoogleApi": "Также есть опыт работы и интеграции в проекты таких google сервисов, как:",
  "FirebaseApi": "Для мобильных приложений есть опыт работы с Firebase, а именно:",
  "PushNotifications": "Push-уведмоления",
  "BackendPushNotifications": "Отправка Push-уведомлений c бэкенда",
  "MainInfoBlock3": "На мобильных устройствах есть опыт реализации чата, с отправкой\n" +
    "изображений и файлов. Есть опыт реализации с deep linking для мобильных\n" +
    "приложений. Для мобильных приложений спокойно могу работать с локальными\n" +
    "базами данных, или же с поддержкой сервера. При необходимости могу\n" +
    "граммотно миксовать два тип сервер + локальная бд. Имею опыт реализации\n" +
    "dark/light theme для мобильных приложений.",
  "MainInfoBlock4": "Имеется опыт работы с монолитной и микросервисной архитектурой. Также имеется\n" +
    "опыт создания переодически выполняемых задач на стороне бэкенда.",
  "TechnologyStack": "Стэк технологий",
  "AutomationTesting": "Автоматизация тестирования:",
  "CI/CD Instruments": "Инструменты CI/CD:",
  "SQL databases": "Базы данных SQL:",
  "NOSQL databases": "Базы данных NOSQL:",
  "Instruments": "Инструменты:",
  "MainRQTimerDescription": "приложение для мониторинга боссов в MMORPG. Самый успешный и\n" +
    "высоко нагруженный проект. Имеет серверную и 3 раных клиентских части: Desktop,\n" +
    "Mobile, Web.",
  "MainTaskManagerDescription": "самый первый мой проект. Приложение для\n" +
    "заметок/задач. Имеет 2 клиентские части: Web, Mobile",
  "MainShipshapeDescription": "социальная сеть для обмена советами\n" +
    "по красоте и уходу за собой. Имеется только мобильная клиентская часть. В приложении есть посты,\n" +
    "статьи, профиль пользователя, deep linking, чат.",
  "MainDailyFoodDescription": "приложение для списка покупок и рецептов.\n" +
    "Имеется только мобильная клиентская часть. В приложении есть сторис, широкий выбор продуктов,\n" +
    "возможность создавать рецепты с фотографиями, категории, достижения.",
  "MainTodoDescription": "приложения для списка дел. От Task Manager\n" +
    "отличается тем, что работает без поддержки сервера. И имеет более обширный функционал.",
  "MainLanguages": "Языки",
  "All applications can be viewed/downloaded in": "Все приложения можно посмотреть/скачать в",
  "my profile": "моем профиле",
  "Russian — native": "Русский — родной",
  "English - speak and understand fluently": "English — свободно говорю и понимаю",
  "Contacts": "Контакты"
}


export const EducationRuLocales = {
  "EducationBlock1": "На данный момент у меня только среднее общее образование. Но это не мешает мне жить\n" +
    "и разиваваться :)",
  "EducationBlock2": 'Пробовал ли я получать высшее/среднее специально образование? Да. Какое-то время\n' +
    'учился в Смоленский филиал НИУ "МЭИ" и посещал дополнительную профессиональную\n' +
    'переподготовку по направлению "Управление персоналом". Совмещал работу QA Automation\n' +
    'Engineer с учебой, но на 3-м курсе я бросил обучение.'
}


export const WorkRuLocales = {
  "WorkExperience": "2 года 6 месяцев",
  "AlemiraTitle": "Декабрь 2020 - настоящее время",
  "Moscow": "Москва",
  "AlemiraProject": "Проект: Образовательный комплекс для создания виртуальных лабораторных работ.\n" +
    "Образовательная платформа для курсов.",
  "AlemiraAchievements": "Достижения: С нуля поднял тестирование на двух проектах. Сделал множество\n" +
    "интеграций для автотестов. С нуля за два месяца полностью автоматизировал все\n" +
    "регрессионной тестирование. Выстроил инфраструктуру в GitLab CI с использованием\n" +
    "Docker Registry.",
  "WakeAppTitle": "Сентябрь 2020 — Декабрь 2020",
  "WakeAppProject": "Проект: Маркетинговая CRM система для обработки KPI, кликов, конверсий, продаж.",
  "WakeAppAchievements": "Достижения: С нуля написал автотесты для API. Поднял инфраструктуру автотестов\n" +
    "в Jenkins + проинтегрировал Jenkins со Slack. Сделал интеграцию с MySQL, что\n" +
    "позволило тестам работать на любом окружении - тесты сами создавали себе\n" +
    "необходимые данные. Большим достижением является то, что написанные мною автотесты\n" +
    "до сих пор (08.07.2021) работают в Jenkins CI и успешно функционаруют, при этом\n" +
    "никаких правок в автотесты и сам фрэймворк не вносилось.",
  "InfotecsTitle": "Январь 2020 — Август 2020",
  "InfotecsProject": "Проект: Автоматизированный комплекс для поисковой, журналистской, расследовательской деятельности.",
  "InfotecsAchievements": "Достижения: С нуля поднял API/UI тестирование. Внес значительные\n" +
    "изменения в флоу работы команды: описание задач, составление баг\n" +
    "репортов, тестирование исправленных багов. Когда я пришел в\n" +
    "компанию, продукт находился на стадии разработки и даже не была\n" +
    "выпущена версия. К выходу первой версии, продукт был полностью\n" +
    "покрыт автотестами, было найдено и проконтролированно множество багов.",
  "OmnicommTitle1": "Сентябрь 2019 — Декабрь 2019",
  "OmnicommProject1": "Проект: Образовательная платформа для создания лабораторных работ, тестовых заданий",
  "OmnicommAchievements1": "Достижения: По собсвенному желанию начал автоматизацию на проекте.\n" +
    "С нуля были автоматизированны все регрессионные тесты.",
  "OmnicommTitle2": "Февраль 2019 — Август 2019",
  "OmnicommProject2": "Проект: Комплекс по контролю топлива в грузовом транспорте",
  "OmnicommAchievements2": "Достижения: Первый из команды предложил внедрение автоматизированного тестирования,\n" +
    "в последующем был перевед на другой проект для развития автоматизации."
}
