export const ruLocales = {
  "NikitaFilonov": "Никита Филонов",
  "Get started": "Перейти к резюме",
  "Search": "Поиск",
  "Home": "Главная",
  "Overview": "Обзор",
  "Education": "Образование",
  "Experience": "Опыт работы",
  "Projects": "Проекты",
  "Languages": "Язык"
}

export const MainRuLocales = {
  "Welcome": "Добро пожаловать! Вы находитесь на личном сайте Никиты Филонова.",
  "WelcomeSubtitle": "Я увлекаюсь веб и мобильной разработкой",
  "HighProductivity": "Высокая продуктивность",
  "HighProductivityDescription": "Я всегда нацелен на результат. Если проект мне\n" +
    "интересен, то я способен сделать проект за неделю,\n" +
    "в то время, когда другим разработчикам требуются месяцы\n" +
    "на реализацию.",
  "ModernStack": "Современный стэк",
  "ModernStackDescription": "Я использую только современные технологии, которые\n" +
    "обеспечивают высокую продизводительность. А также\n" +
    "позволяют легко маштабировать проект.",
  "VersatileExperience": "Разносторонний опыт",
  "VersatileExperienceDescription": "В моей практике был опыт, как бэкенд разработки, так и\n" +
    "фронтенд (веб/мобилка). Есть огромный опыт написания\n" +
    "автотестов, поэтому мой код всегда покрывается\n" +
    "API и Unit тестами. Для меня не проблема настроить\n" +
    "инфраструктуру проекта в CI/CD."
}
