import React from "react";

export const Ulyana = () => {
  return (
    <div className={'container container-fluid mb-5'}>
      Уляшик, поздравляю тебя с днем рождения! Ты очень хорошая, добрая, умная, красивая девушка, оставайся
      такой всегда. Такой, как ты цены не будет. И еще раз хочу попросить прощения за все свои косяки,
      спасибо, что ты находишься рядом, я очень это ценю. В тебе очень много любви и заботы, что
      очень хорошо для девушки.
      В свое время ты мне сильно помогла, за что я тебе всегда будут благодарен

      У меня есть для тебя подарок, мне бы хотелось, чтобы ты помогла мне тебе его подарить, хотя бы пустила меня)
    </div>
  )
}
